In [1]:
%load_ext sql

In [3]:
%sql mysql+pymysql://root:kipsang@localhost:3306/md_water_services

Connecting to 'mysql+pymysql://root:***@localhost:3306/md_water_services'

In [4]:
%%sql
SHOW TABLES

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

9 rows affected.

+-----------------------------+
| Tables_in_md_water_services |
+-----------------------------+
|       data_dictionary       |
|           employee          |
|     global_water_access     |
|           location          |
|            visits           |
|        water_quality        |
|         water_source        |
|        well_pollution       |
|    well_pollution_backup    |
+-----------------------------+

In [5]:
%%sql
DROP TABLE IF EXISTS `auditor_report`;
CREATE TABLE `auditor_report` (
`location_id` VARCHAR(32),
`type_of_water_source` VARCHAR(64),
`true_water_source_score` int DEFAULT NULL,
`statements` VARCHAR(255)
);

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

++
||
++
++

In [9]:
%%sql
SELECT
auditor_report.location_id AS audit_location,
auditor_report.true_water_source_score,
visits.location_id AS visit_location,
visits.record_id
FROM
auditor_report
JOIN
visits
ON auditor_report.location_id = visits.location_id;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2698 rows affected.

+----------------+-------------------------+----------------+-----------+
| audit_location | true_water_source_score | visit_location | record_id |
+----------------+-------------------------+----------------+-----------+
|   SoRu34980    |            1            |   SoRu34980    |    5185   |
|   AkRu08112    |            3            |   AkRu08112    |   59367   |
|   AkLu02044    |            0            |   AkLu02044    |   37379   |
|   AkHa00421    |            3            |   AkHa00421    |   51627   |
|   SoRu35221    |            0            |   SoRu35221    |   28758   |
|   HaAm16170    |            1            |   HaAm16170    |   31048   |
|   AkRu04812    |            3            |   AkRu04812    |    1513   |
|   AkRu08304    |            3            |   AkRu08304    |    1218   |
|   AkRu05107    |            2            |   AkRu05107    |    8322   |
|   AkRu05215    |            3            |   AkRu05215    |   21160   |
+----------------+-------------------------+----------------+-----------+
Truncated to displaylimit of 10.

In [11]:
%%sql
SELECT
  auditor_report.location_id AS audit_location,
  auditor_report.true_water_source_score,
  visits.location_id AS visit_location,
  visits.record_id
FROM
  auditor_report
JOIN
  visits ON auditor_report.location_id = visits.location_id;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2698 rows affected.

+----------------+-------------------------+----------------+-----------+
| audit_location | true_water_source_score | visit_location | record_id |
+----------------+-------------------------+----------------+-----------+
|   SoRu34980    |            1            |   SoRu34980    |    5185   |
|   AkRu08112    |            3            |   AkRu08112    |   59367   |
|   AkLu02044    |            0            |   AkLu02044    |   37379   |
|   AkHa00421    |            3            |   AkHa00421    |   51627   |
|   SoRu35221    |            0            |   SoRu35221    |   28758   |
|   HaAm16170    |            1            |   HaAm16170    |   31048   |
|   AkRu04812    |            3            |   AkRu04812    |    1513   |
|   AkRu08304    |            3            |   AkRu08304    |    1218   |
|   AkRu05107    |            2            |   AkRu05107    |    8322   |
|   AkRu05215    |            3            |   AkRu05215    |   21160   |
+----------------+-------------------------+----------------+-----------+
Truncated to displaylimit of 10.

In [12]:
%%sql
SELECT
  auditor_report.location_id,
  visits.record_id,
  auditor_report.true_water_source_score AS auditor_score,
  wq.subjective_quality_score AS surveyor_score
FROM
  auditor_report
JOIN
  visits ON auditor_report.location_id = visits.location_id
JOIN
  water_quality AS wq ON visits.record_id = wq.record_id;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2698 rows affected.

+-------------+-----------+---------------+----------------+
| location_id | record_id | auditor_score | surveyor_score |
+-------------+-----------+---------------+----------------+
|  SoRu34980  |    5185   |       1       |       1        |
|  AkRu08112  |   59367   |       3       |       3        |
|  AkLu02044  |   37379   |       0       |       0        |
|  AkHa00421  |   51627   |       3       |       3        |
|  SoRu35221  |   28758   |       0       |       0        |
|  HaAm16170  |   31048   |       1       |       1        |
|  AkRu04812  |    1513   |       3       |       3        |
|  AkRu08304  |    1218   |       3       |       3        |
|  AkRu05107  |    8322   |       2       |       2        |
|  AkRu05215  |   21160   |       3       |       10       |
+-------------+-----------+---------------+----------------+
Truncated to displaylimit of 10.

In [13]:
%%sql
SELECT
  auditor_report.location_id,
  visits.record_id,
  auditor_report.true_water_source_score AS auditor_score,
  wq.subjective_quality_score AS surveyor_score
FROM
  auditor_report
JOIN
  visits ON auditor_report.location_id = visits.location_id
JOIN
  water_quality AS wq ON visits.record_id = wq.record_id
WHERE
  visits.visit_count = 1
LIMIT 10000;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1620 rows affected.

+-------------+-----------+---------------+----------------+
| location_id | record_id | auditor_score | surveyor_score |
+-------------+-----------+---------------+----------------+
|  SoRu34980  |    5185   |       1       |       1        |
|  AkRu08112  |   59367   |       3       |       3        |
|  AkLu02044  |   37379   |       0       |       0        |
|  AkHa00421  |   51627   |       3       |       3        |
|  SoRu35221  |   28758   |       0       |       0        |
|  HaAm16170  |   31048   |       1       |       1        |
|  AkRu04812  |    1513   |       3       |       3        |
|  AkRu08304  |    1218   |       3       |       3        |
|  AkRu05107  |    8322   |       2       |       2        |
|  AkRu05215  |   21160   |       3       |       10       |
+-------------+-----------+---------------+----------------+
Truncated to displaylimit of 10.

In [14]:
%%sql
SELECT
  auditor_report.location_id,
  visits.record_id,
  auditor_report.true_water_source_score AS auditor_score,
  wq.subjective_quality_score AS surveyor_score
FROM
  auditor_report
JOIN
  visits ON auditor_report.location_id = visits.location_id
JOIN
  water_quality AS wq ON visits.record_id = wq.record_id
WHERE
  visits.visit_count = 1
  AND auditor_report.true_water_source_score != wq.subjective_quality_score;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

102 rows affected.

+-------------+-----------+---------------+----------------+
| location_id | record_id | auditor_score | surveyor_score |
+-------------+-----------+---------------+----------------+
|  AkRu05215  |   21160   |       3       |       10       |
|  KiRu29290  |    7938   |       3       |       10       |
|  KiHa22748  |   43140   |       9       |       10       |
|  SoRu37841  |   18495   |       6       |       10       |
|  KiRu27884  |   33931   |       1       |       10       |
|  KiZu31170  |   17950   |       9       |       10       |
|  KiZu31370  |   36864   |       3       |       10       |
|  AkRu06495  |   45924   |       2       |       10       |
|  HaRu17528  |   30524   |       1       |       10       |
|  SoRu38331  |   13192   |       3       |       10       |
+-------------+-----------+---------------+----------------+
Truncated to displaylimit of 10.

In [15]:
%%sql
SELECT
  auditor_report.location_id,
  visits.record_id,
  employee.employee_name,
  auditor_report.true_water_source_score AS auditor_score,
  wq.subjective_quality_score AS surveyor_score
FROM
  auditor_report
JOIN
  visits ON auditor_report.location_id = visits.location_id
JOIN
  water_quality AS wq ON visits.record_id = wq.record_id
JOIN
  employee ON employee.assigned_employee_id = visits.assigned_employee_id
WHERE
  visits.visit_count = 1
  AND auditor_report.true_water_source_score != wq.subjective_quality_score;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

102 rows affected.

+-------------+-----------+----------------+---------------+----------------+
| location_id | record_id | employee_name  | auditor_score | surveyor_score |
+-------------+-----------+----------------+---------------+----------------+
|  AkRu05215  |   21160   |   Rudo Imani   |       3       |       10       |
|  KiRu29290  |    7938   |  Bello Azibo   |       3       |       10       |
|  KiHa22748  |   43140   |  Bello Azibo   |       9       |       10       |
|  SoRu37841  |   18495   |   Rudo Imani   |       6       |       10       |
|  KiRu27884  |   33931   |  Bello Azibo   |       1       |       10       |
|  KiZu31170  |   17950   | Zuriel Matembo |       9       |       10       |
|  KiZu31370  |   36864   | Yewande Ebele  |       3       |       10       |
|  AkRu06495  |   45924   |  Bello Azibo   |       2       |       10       |
|  HaRu17528  |   30524   | Jengo Tumaini  |       1       |       10       |
|  SoRu38331  |   13192   | Zuriel Matembo |       3       |       10       |
+-------------+-----------+----------------+---------------+----------------+
Truncated to displaylimit of 10.

In [16]:
%%sql
CREATE VIEW Incorrect_records AS
SELECT
  auditor_report.location_id,
  visits.record_id,
  employee.employee_name,
  auditor_report.true_water_source_score AS auditor_score,
  wq.subjective_quality_score AS surveyor_score,
  auditor_report.statements AS statements
FROM
  auditor_report
JOIN
  visits ON auditor_report.location_id = visits.location_id
JOIN
  water_quality AS wq ON visits.record_id = wq.record_id
JOIN
  employee ON employee.assigned_employee_id = visits.assigned_employee_id
WHERE
  visits.visit_count = 1
  AND auditor_report.true_water_source_score != wq.subjective_quality_score;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

++
||
++
++

In [17]:
%%sql
SELECT * FROM Incorrect_records LIMIT 10;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

10 rows affected.

+-------------+-----------+----------------+---------------+----------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| location_id | record_id | employee_name  | auditor_score | surveyor_score |                                                                                         statements                                                                                        |
+-------------+-----------+----------------+---------------+----------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|  AkRu05215  |   21160   |   Rudo Imani   |       3       |       10       |                                          Villagers admired the official's visit for its respectful interactions, hard work, and genuine concern.                                          |
|  KiRu29290  |    7938   |  Bello Azibo   |       3       |       10       |                                      A young artist sketches the faces in the queue, capturing the weariness of daily hours spent waiting for water.                                      |
|  KiHa22748  |   43140   |  Bello Azibo   |       9       |       10       |                                            A young girl's hopeful eyes are clouded by mistrust, her innocence tarnished by the corrupt system.                                            |
|  SoRu37841  |   18495   |   Rudo Imani   |       6       |       10       |                           The official's respectful and diligent presence was met with heartfelt appreciation, creating a sense of closeness with the villagers.                          |
|  KiRu27884  |   33931   |  Bello Azibo   |       1       |       10       |                                           A traditional healer's empathy turns to bitterness, knowing that corrupt practices harm her community.                                          |
|  KiZu31170  |   17950   | Zuriel Matembo |       9       |       10       |                                     A community leader stood with his people, expressing concern for the water quality and the time lost in queues.","                                    |
|  KiZu31370  |   36864   | Yewande Ebele  |       3       |       10       |                                  With a keen understanding of urban challenges, the official's visit left a lasting impression of respect and commitment.                                 |
|  AkRu06495  |   45924   |  Bello Azibo   |       2       |       10       |                                        A healthcare worker in the queue expressed fears about water-borne diseases, her face etched with worry.","                                        |
|  HaRu17528  |   30524   | Jengo Tumaini  |       1       |       10       |                                    With humility and diligence, the official formed bonds with the villagers that felt like genuine family connections.                                   |
|  SoRu38331  |   13192   | Zuriel Matembo |       3       |       10       | An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts. |
+-------------+-----------+----------------+---------------+----------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

In [18]:
%%sql
WITH error_count AS (
  SELECT
    employee_name,
    COUNT(employee_name) AS number_of_mistakes
  FROM
    Incorrect_records
  GROUP BY
    employee_name
)
SELECT * FROM error_count;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

17 rows affected.

+----------------+--------------------+
| employee_name  | number_of_mistakes |
+----------------+--------------------+
|   Rudo Imani   |         5          |
|  Bello Azibo   |         26         |
| Zuriel Matembo |         17         |
| Yewande Ebele  |         3          |
| Jengo Tumaini  |         3          |
|   Farai Nia    |         4          |
| Malachi Mavuso |         21         |
|  Makena Thabo  |         3          |
| Lalitha Kaburi |         7          |
|  Gamba Shani   |         3          |
+----------------+--------------------+
Truncated to displaylimit of 10.

In [19]:
%%sql
SELECT AVG(number_of_mistakes) AS avg_error_count_per_empl
FROM (
  SELECT employee_name, COUNT(*) AS number_of_mistakes
  FROM Incorrect_records
  GROUP BY employee_name
) AS error_count;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+--------------------------+
| avg_error_count_per_empl |
+--------------------------+
|          6.0000          |
+--------------------------+

In [20]:
%%sql
-- 1 Identify employees with above-average mistakes (suspect_list)
WITH error_count AS (
  SELECT employee_name, COUNT(*) AS number_of_mistakes
  FROM Incorrect_records
  GROUP BY employee_name
),
suspect_list AS (
  SELECT employee_name, number_of_mistakes
  FROM error_count
  WHERE number_of_mistakes > (SELECT AVG(number_of_mistakes) FROM error_count)
)
SELECT * FROM suspect_list;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

4 rows affected.

+----------------+--------------------+
| employee_name  | number_of_mistakes |
+----------------+--------------------+
|  Bello Azibo   |         26         |
| Zuriel Matembo |         17         |
| Malachi Mavuso |         21         |
| Lalitha Kaburi |         7          |
+----------------+--------------------+

In [24]:
%%sql 
WITH error_count AS (
  SELECT employee_name, COUNT(*) AS number_of_mistakes
  FROM Incorrect_records
  GROUP BY employee_name
),
suspect_list AS (
  SELECT employee_name, number_of_mistakes
  FROM error_count
  WHERE number_of_mistakes > (SELECT AVG(number_of_mistakes) FROM error_count)
)
SELECT
  employee_name,
  location_id,
  statements
FROM
  Incorrect_records
WHERE
  employee_name IN (SELECT employee_name FROM suspect_list);

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

71 rows affected.

+----------------+-------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| employee_name  | location_id |                                                                                         statements                                                                                        |
+----------------+-------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|  Bello Azibo   |  KiRu29290  |                                      A young artist sketches the faces in the queue, capturing the weariness of daily hours spent waiting for water.                                      |
|  Bello Azibo   |  KiHa22748  |                                            A young girl's hopeful eyes are clouded by mistrust, her innocence tarnished by the corrupt system.                                            |
|  Bello Azibo   |  KiRu27884  |                                           A traditional healer's empathy turns to bitterness, knowing that corrupt practices harm her community.                                          |
| Zuriel Matembo |  KiZu31170  |                                     A community leader stood with his people, expressing concern for the water quality and the time lost in queues.","                                    |
|  Bello Azibo   |  AkRu06495  |                                        A healthcare worker in the queue expressed fears about water-borne diseases, her face etched with worry.","                                        |
| Zuriel Matembo |  SoRu38331  | An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts. |
| Malachi Mavuso |  AmAm09607  |       Villagers spoke of an unsettling encounter with an official who appeared dismissive and detached. The reference to cash transactions added to their growing sense of distrust.      |
| Zuriel Matembo |  AkHa00314  |                                    A street vendor's sales suffer from time spent waiting, her concern for the water's quality affecting her products.                                    |
| Malachi Mavuso |  KiRu26598  |                                      A teenager's dreams are tempered by reality, her future threatened by the corrupt practices she sees around her.                                     |
|  Bello Azibo   |  KiIs23853  |       Villagers' wary accounts of an official's arrogance and detachment from their concerns raised suspicions. The mention of cash changing hands further tainted their perception.      |
+----------------+-------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

In [27]:
%%sql
WITH error_count AS (
  SELECT
    employee_name,
    COUNT(*) AS number_of_mistakes
  FROM
    Incorrect_records
  GROUP BY
    employee_name
)
SELECT
  AVG(number_of_mistakes) AS average_mistakes_per_employee
FROM
  error_count;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+-------------------------------+
| average_mistakes_per_employee |
+-------------------------------+
|             6.0000            |
+-------------------------------+

In [29]:
%%sql
    WITH error_count AS (
  SELECT
    employee_name,
    COUNT(*) AS number_of_mistakes
  FROM
    Incorrect_records
  GROUP BY
    employee_name
)
SELECT
  employee_name,
  number_of_mistakes
FROM
  error_count
WHERE
  number_of_mistakes > (SELECT AVG(number_of_mistakes) FROM error_count)
ORDER BY
  number_of_mistakes DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

4 rows affected.

+----------------+--------------------+
| employee_name  | number_of_mistakes |
+----------------+--------------------+
|  Bello Azibo   |         26         |
| Malachi Mavuso |         21         |
| Zuriel Matembo |         17         |
| Lalitha Kaburi |         7          |
+----------------+--------------------+

In [31]:
%%sql
SELECT 
    employee_name,
    statements
FROM 
    Incorrect_records
WHERE 
    statements LIKE '%Suspicion coloured villagers%';

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

+---------------+------------+
| employee_name | statements |
+---------------+------------+
+---------------+------------+

In [32]:
%%sql
SELECT
auditorRep.location_id,
visitsTbl.record_id,
auditorRep.true_water_source_score AS auditor_score,
wq.subjective_quality_score AS employee_score,
wq.subjective_quality_score - auditorRep.true_water_source_score  AS score_diff
FROM auditor_report AS auditorRep
JOIN visits AS visitsTbl
ON auditorRep.location_id = visitsTbl.location_id
JOIN water_quality AS wq
ON visitsTbl.record_id = wq.record_id
WHERE (wq.subjective_quality_score - auditorRep.true_water_source_score) > 9;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

10 rows affected.

+-------------+-----------+---------------+----------------+------------+
| location_id | record_id | auditor_score | employee_score | score_diff |
+-------------+-----------+---------------+----------------+------------+
|  SoBa31691  |    3267   |       0       |       10       |     10     |
|  AkHa00363  |   25387   |       0       |       10       |     10     |
|  SoKo33094  |   16159   |       0       |       10       |     10     |
|  KiRu27364  |   38102   |       0       |       10       |     10     |
|  KiRu27065  |   29772   |       0       |       10       |     10     |
|  KiRu29147  |    3179   |       0       |       10       |     10     |
|  SoIl32770  |    7548   |       0       |       10       |     10     |
|  KiRu29329  |   11962   |       0       |       10       |     10     |
|  SoRu39544  |   17929   |       0       |       10       |     10     |
|  SoRu38535  |   44282   |       0       |       10       |     10     |
+-------------+-----------+---------------+----------------+------------+
Truncated to displaylimit of 10.